

#Область СлужебныеФункции

&НаКлиенте
Процедура УстановитьШрифты()
	Если Объект.ШрифтТекстаФорм = неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеИзменений



#КонецОбласти

#Область СобытияФормы

#Область ИнициализацияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьШрифты();
КонецПроцедуры

#КонецОбласти

#Область ПриИзменении

&НаКлиенте
Процедура ПриИзмененииШрифтаТекстаФорм(Элемент)
	УстановитьШрифты();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Асинх Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Ответ = ждать ВопросАсинх(
	    "Вы уверены, что хотите закрыть форму? Все несохраненные изменения будут утеряны",
		РежимДиалогаВопрос.ДаНет
	);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти